dasdasd12/hardware/firmware/ch585/bsp/hal/MCU.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : MCU.c
 * Author             : WCH
 * Version            : V1.2
 * Date               : 2022/01/18
 * Description        : Ӳ��������������BLE��Ӳ����ʼ��
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/

/******************************************************************************/
/* ͷ�ļ����� */
#include "HAL.h"

tmosTaskID halTaskID;
uint32_t g_LLE_IRQLibHandlerLocation;
static uint8_t s_radio_calibration_enabled = 1U;
/*******************************************************************************
 * @fn      Lib_Calibration_LSI
 *
 * @brief   �ڲ�32kУ׼
 *
 * @param   None.
 *
 * @return  None.
 */
void Lib_Calibration_LSI(void)
{
    Calibration_LSI(Level_64);
}

#ifndef CH585_BLE_PAIRING_EXT_EEPROM
#define CH585_BLE_PAIRING_EXT_EEPROM 0
#endif

#if(defined(BLE_SNV)) && (BLE_SNV == TRUE)
#if CH585_BLE_PAIRING_EXT_EEPROM
/* BLE pairing (SNV) data lives in the external HX24LC16B I2C EEPROM
 * (left half, U2); the SNV address window maps to external offset 0.
 * EEPROM bytes are directly rewritable, so no erase step is needed. */
#include "ch585_eeprom_i2c.h"

#if ((BLE_SNV_BLOCK * BLE_SNV_NUM) > CH585_EEPROM_I2C_SIZE)
#error "BLE SNV window does not fit in the external EEPROM"
#endif

static uint8_t s_ble_snv_eeprom_ready;
static uint8_t s_ble_snv_eeprom_fault_reported;

static void ble_snv_eeprom_mark_fault(const char *operation)
{
    s_ble_snv_eeprom_ready = 0U;
    if(s_ble_snv_eeprom_fault_reported == 0U)
    {
        s_ble_snv_eeprom_fault_reported = 1U;
        PRINT("BLE SNV EEPROM %s failed; persistence disabled\n", operation);
    }
    (void)operation;
}

static uint8_t ble_snv_eeprom_range(uint32_t addr,
                                    uint32_t num,
                                    uint16_t *offset,
                                    uint16_t *byte_count)
{
    const uint32_t window_size = (uint32_t)BLE_SNV_BLOCK * BLE_SNV_NUM;
    uint32_t relative;
    uint32_t bytes;

    if((offset == 0) || (byte_count == 0) ||
       ((addr & 0x03U) != 0U) || (num > (UINT32_MAX / 4U)) ||
       (addr < (uint32_t)BLE_SNV_ADDR))
    {
        return 0U;
    }

    relative = addr - (uint32_t)BLE_SNV_ADDR;
    bytes = num * 4U;
    if((relative > window_size) || (bytes > (window_size - relative)) ||
       ((relative + bytes) > CH585_EEPROM_I2C_SIZE) ||
       (relative > UINT16_MAX) || (bytes > UINT16_MAX))
    {
        return 0U;
    }

    *offset = (uint16_t)relative;
    *byte_count = (uint16_t)bytes;
    return 1U;
}

uint32_t Lib_Read_Flash(uint32_t addr, uint32_t num, uint32_t *pBuf)
{
    uint16_t offset;
    uint16_t byte_count;

    if((pBuf == 0) ||
       (ble_snv_eeprom_range(addr, num, &offset, &byte_count) == 0U))
    {
        ble_snv_eeprom_mark_fault("read range");
        return (uint32_t)NV_OPER_FAILED;
    }

    if((s_ble_snv_eeprom_ready == 0U) ||
       (ch585_eeprom_i2c_read(offset, (uint8_t *)pBuf, byte_count) == 0U))
    {
        /* Some WCH SNV paths ignore the callback return value. Present a
         * deterministic erased block instead of partially read/heap data. */
        tmos_memset(pBuf, 0xFF, byte_count);
        ble_snv_eeprom_mark_fault("read");
        return (uint32_t)NV_OPER_FAILED;
    }
    return (uint32_t)SUCCESS;
}

uint32_t Lib_Write_Flash(uint32_t addr, uint32_t num, uint32_t *pBuf)
{
    uint16_t offset;
    uint16_t byte_count;

    if((pBuf == 0) ||
       (ble_snv_eeprom_range(addr, num, &offset, &byte_count) == 0U))
    {
        ble_snv_eeprom_mark_fault("write range");
        return (uint32_t)NV_OPER_FAILED;
    }

    if((s_ble_snv_eeprom_ready == 0U) ||
       (ch585_eeprom_i2c_write(offset,
                               (const uint8_t *)pBuf,
                               byte_count) == 0U))
    {
        ble_snv_eeprom_mark_fault("write");
        return (uint32_t)NV_OPER_FAILED;
    }
    return (uint32_t)SUCCESS;
}
#else
/*******************************************************************************
 * @fn      Lib_Read_Flash
 *
 * @brief   Callback function used for BLE lib.
 *
 * @param   addr - Read start address
 * @param   num - Number of units to read (unit: 4 bytes)
 * @param   pBuf - Buffer to store read data
 *
 * @return  None.
 */
uint32_t Lib_Read_Flash(uint32_t addr, uint32_t num, uint32_t *pBuf)
{
    EEPROM_READ(addr, pBuf, num * 4);
    return 0;
}

/*******************************************************************************
 * @fn      Lib_Write_Flash_584X
 *
 * @brief   Callback function used for BLE lib.
 *
 * @param   addr - Write start address
 * @param   num - Number of units to write (unit: 4 bytes)
 * @param   pBuf - Buffer with data to be written
 *
 * @return  None.
 */
void Lib_Write_Flash_584X(uint32_t addr, uint32_t num, uint32_t *pBuf)
{
    __attribute__((aligned(4))) uint32_t FLASH_BUF[(BLE_SNV_BLOCK*BLE_SNV_NUM) / 4];
    EEPROM_READ(addr&0xFFFFF000, FLASH_BUF, BLE_SNV_BLOCK*BLE_SNV_NUM);
    tmos_memcpy(&FLASH_BUF[addr&0xFFF], pBuf, num * 4);
    EEPROM_ERASE(addr&0xFFFFF000, ((BLE_SNV_BLOCK*BLE_SNV_NUM+EEPROM_BLOCK_SIZE-1)/EEPROM_BLOCK_SIZE)*EEPROM_BLOCK_SIZE);
    EEPROM_WRITE(addr&0xFFFFF000, FLASH_BUF, BLE_SNV_BLOCK*BLE_SNV_NUM);
}

/*******************************************************************************
 * @fn      Lib_Write_Flash
 *
 * @brief   Callback function used for BLE lib.
 *
 * @param   addr - Write start address
 * @param   num - Number of units to write (unit: 4 bytes)
 * @param   pBuf - Buffer with data to be written
 *
 * @return  None.
 */
uint32_t Lib_Write_Flash(uint32_t addr, uint32_t num, uint32_t *pBuf)
{
    if((chip_info&0x0F) == DEF_CHIP_ID_CH584X)
    {
        Lib_Write_Flash_584X(addr, num, pBuf);
    }
    else
    {
        EEPROM_ERASE(addr, num * 4);
        EEPROM_WRITE(addr, pBuf, num * 4);
    }
    return 0;
}
#endif /* CH585_BLE_PAIRING_EXT_EEPROM */
#endif

/*******************************************************************************
 * @fn      CH58x_BLEInit
 *
 * @brief   BLE ���ʼ��
 *
 * @param   None.
 *
 * @return  None.
 */
void CH58x_BLEInit(void)
{
    uint8_t     i;
    bleConfig_t cfg;
    if(tmos_memcmp(VER_LIB, VER_FILE, strlen(VER_FILE)) == FALSE)
    {
        PRINT("head file error...\n");
        while(1);
    }

    __SysTick_Config(SysTick_LOAD_RELOAD_Msk);// ����SysTick�����ж�
    PFIC_DisableIRQ(SysTick_IRQn);

    g_LLE_IRQLibHandlerLocation = (uint32_t)LLE_IRQLibHandler;
    PFIC_SetPriority(BLEL_IRQn, 0xF0);
    tmos_memset(&cfg, 0, sizeof(bleConfig_t));
    cfg.MEMAddr = (uint32_t)MEM_BUF;
    cfg.MEMLen = (uint32_t)BLE_MEMHEAP_SIZE;
    cfg.BufMaxLen = (uint32_t)BLE_BUFF_MAX_LEN;
    cfg.BufNumber = (uint32_t)BLE_BUFF_NUM;
    cfg.TxNumEvent = (uint32_t)BLE_TX_NUM_EVENT;
    cfg.TxPower = (uint32_t)BLE_TX_POWER;
#if(defined(BLE_SNV)) && (BLE_SNV == TRUE)
    if((BLE_SNV_ADDR + BLE_SNV_BLOCK * BLE_SNV_NUM) > (0x78000 - FLASH_ROM_MAX_SIZE))
    {
        PRINT("SNV config error...\n");
        while(1);
    }
#if CH585_BLE_PAIRING_EXT_EEPROM
    ch585_eeprom_i2c_init();
    if(ch585_eeprom_i2c_probe() != 0U)
    {
        s_ble_snv_eeprom_ready = 1U;
        s_ble_snv_eeprom_fault_reported = 0U;
        cfg.SNVAddr = (uint32_t)BLE_SNV_ADDR;
        cfg.SNVBlock = (uint32_t)BLE_SNV_BLOCK;
        cfg.SNVNum = (uint32_t)BLE_SNV_NUM;
        cfg.readFlashCB = Lib_Read_Flash;
        cfg.writeFlashCB = Lib_Write_Flash;
    }
    else
    {
        /* cfg was zeroed above. A zero SNVAddr is the WCH-supported mode for
         * running BLE without claiming that bonding data is persistent. */
        ble_snv_eeprom_mark_fault("probe");
    }
#else
    cfg.SNVAddr = (uint32_t)BLE_SNV_ADDR;
    cfg.SNVBlock = (uint32_t)BLE_SNV_BLOCK;
    cfg.SNVNum = (uint32_t)BLE_SNV_NUM;
    cfg.readFlashCB = Lib_Read_Flash;
    cfg.writeFlashCB = Lib_Write_Flash;
#endif
#endif
    cfg.ConnectNumber = (PERIPHERAL_MAX_CONNECTION & 3) | (CENTRAL_MAX_CONNECTION << 2);
    cfg.srandCB = SYS_GetSysTickCnt;
#if(defined TEM_SAMPLE) && (TEM_SAMPLE == TRUE)
    cfg.tsCB = HAL_GetInterTempValue; // �����¶ȱ仯У׼RF���ڲ�RC( ����7���϶� )
  #if(CLK_OSC32K)
    cfg.rcCB = Lib_Calibration_LSI; // �ڲ�32Kʱ��У׼
  #endif
#endif
#if(defined(HAL_SLEEP)) && (HAL_SLEEP == TRUE)
    cfg.idleCB = CH58x_LowPower; // ����˯��
#endif
#if(defined(BLE_MAC)) && (BLE_MAC == TRUE)
    for(i = 0; i < 6; i++)
    {
        cfg.MacAddr[i] = MacAddr[5 - i];
    }
#else
    {
        uint8_t MacAddr[6];
        GetMACAddress(MacAddr);
        for(i = 0; i < 6; i++)
        {
            cfg.MacAddr[i] = MacAddr[i]; // ʹ��оƬmac��ַ
        }
    }
#endif
    if(!cfg.MEMAddr || cfg.MEMLen < 4 * 1024)
    {
        while(1);
    }
    // BLE_Lib ռ����VTF Interrupt 2�ź�3��
    i = BLE_LibInit(&cfg);
    if(i)
    {
        PRINT("LIB init error code: %x ...\n", i);
        while(1);
    }
}

/*******************************************************************************
 * @fn      HAL_ProcessEvent
 *
 * @brief   Ӳ����������
 *
 * @param   task_id - The TMOS assigned task ID.
 * @param   events  - events to process.  This is a bit map and can
 *                      contain more than one event.
 *
 * @return  events.
 */
tmosEvents HAL_ProcessEvent(tmosTaskID task_id, tmosEvents events)
{
    uint8_t *msgPtr;

    if(events & SYS_EVENT_MSG)
    { // ����HAL����Ϣ������tmos_msg_receive��ȡ��Ϣ��������ɺ�ɾ����Ϣ��
        msgPtr = tmos_msg_receive(task_id);
        if(msgPtr)
        {
            /* De-allocate */
            tmos_msg_deallocate(msgPtr);
        }
        return events ^ SYS_EVENT_MSG;
    }
    if(events & LED_BLINK_EVENT)
    {
#if(defined HAL_LED) && (HAL_LED == TRUE)
        HalLedUpdate();
#endif // HAL_LED
        return events ^ LED_BLINK_EVENT;
    }
    if(events & HAL_KEY_EVENT)
    {
#if(defined HAL_KEY) && (HAL_KEY == TRUE)
        HAL_KeyPoll(); /* Check for keys */
        tmos_start_task(halTaskID, HAL_KEY_EVENT, MS1_TO_SYSTEM_TIME(100));
        return events ^ HAL_KEY_EVENT;
#endif
    }
    if(events & HAL_REG_INIT_EVENT)
    {
        uint8_t x32Kpw;
#if(defined BLE_CALIBRATION_ENABLE) && (BLE_CALIBRATION_ENABLE == TRUE) // У׼���񣬵���У׼��ʱС��10ms
        if(s_radio_calibration_enabled == 0U)
        {
            return events ^ HAL_REG_INIT_EVENT;
        }
#ifndef RF_8K
        BLE_RegInit();                                                  // У׼RF����ر�RF���ı�RF��ؼĴ��������ʹ����RF�շ�������ע��У׼������������
#endif
#if(CLK_OSC32K)
        Lib_Calibration_LSI(); // У׼�ڲ�RC
#elif(HAL_SLEEP)
        x32Kpw = (R8_XT32K_TUNE & 0xfc) | 0x01;
        sys_safe_access_enable();
        R8_XT32K_TUNE = x32Kpw; // LSE�����������͵������
        sys_safe_access_disable();
#endif
        tmos_start_task(halTaskID, HAL_REG_INIT_EVENT, MS1_TO_SYSTEM_TIME(BLE_CALIBRATION_PERIOD));
        return events ^ HAL_REG_INIT_EVENT;
#endif
    }
    if(events & HAL_TEST_EVENT)
    {
        PRINT("* \n");
        tmos_start_task(halTaskID, HAL_TEST_EVENT, MS1_TO_SYSTEM_TIME(1000));
        return events ^ HAL_TEST_EVENT;
    }
    return 0;
}

/*******************************************************************************
 * @fn      HAL_Init
 *
 * @brief   Ӳ����ʼ��
 *
 * @param   None.
 *
 * @return  None.
 */
void HAL_Init()
{
    halTaskID = TMOS_ProcessEventRegister(HAL_ProcessEvent);
    HAL_TimeInit();
#if(defined HAL_SLEEP) && (HAL_SLEEP == TRUE)
    HAL_SleepInit();
#endif
#if(defined HAL_LED) && (HAL_LED == TRUE)
    HAL_LedInit();
#endif
#if(defined HAL_KEY) && (HAL_KEY == TRUE)
    HAL_KeyInit();
#endif
#if(defined BLE_CALIBRATION_ENABLE) && (BLE_CALIBRATION_ENABLE == TRUE)
    tmos_start_task(halTaskID, HAL_REG_INIT_EVENT, 800); // ����У׼����500ms����������У׼��ʱС��10ms
#endif
//    tmos_start_task( halTaskID, HAL_TEST_EVENT, 1600 );    // ����һ����������
}

void HAL_RadioCalibrationSetEnabled(uint8_t enabled)
{
#if(defined BLE_CALIBRATION_ENABLE) && (BLE_CALIBRATION_ENABLE == TRUE)
    uint8_t next = (enabled != 0U) ? 1U : 0U;

    if(next == s_radio_calibration_enabled)
    {
        return;
    }

    s_radio_calibration_enabled = next;
    (void)tmos_stop_task(halTaskID, HAL_REG_INIT_EVENT);
    (void)tmos_clear_event(halTaskID, HAL_REG_INIT_EVENT);
    if(next != 0U)
    {
        /*
         * Never calibrate synchronously inside an SPI mode command.
         * Resume after the boot delay so the current reply can finish.
         */
        (void)tmos_start_task(halTaskID, HAL_REG_INIT_EVENT, 800U);
    }
#else
    (void)enabled;
#endif
}

/*******************************************************************************
 * @fn      HAL_GetInterTempValue
 *
 * @brief   ��ȡ�ڲ��¸в���ֵ�����ʹ����ADC�жϲ��������ڴ˺�������ʱ�����ж�.
 *
 * @return  �ڲ��¸в���ֵ.
 */
uint16_t HAL_GetInterTempValue(void)
{
    uint8_t  sensor, channel, config, tkey_cfg;
    uint16_t adc_data;

    tkey_cfg = R8_TKEY_CFG;
    sensor = R8_TEM_SENSOR;
    channel = R8_ADC_CHANNEL;
    config = R8_ADC_CFG;
    ADC_InterTSSampInit();
    R8_ADC_CONVERT |= RB_ADC_START;
    while(R8_ADC_CONVERT & RB_ADC_START);
    adc_data = R16_ADC_DATA;
    R8_TEM_SENSOR = sensor;
    R8_ADC_CHANNEL = channel;
    R8_ADC_CFG = config;
    R8_TKEY_CFG = tkey_cfg;
    return (adc_data);
}

/******************************** endfile @ mcu ******************************/
